export const quizData = [
  {
    id: 1,
    question: "Какая функция используется для вывода данных в консоль в JavaScript?",
    options: ["print()", "console.log()", "alert()", "display()"],
    correctAnswer: "console.log()",
  },
  {
    id: 2,
    question: "Какой оператор используется для строгого сравнения (значение и тип) в JS?",
    options: ["==", "=", "===", "!="],
    correctAnswer: "===",
  },
  {
    id: 3,
    question: "Как называется функция, которая вызывает сама себя?",
    options: ["Анонимная", "Обратного вызова (Callback)", "Стрелочная", "Рекурсивная"],
    correctAnswer: "Рекурсивная",
  },
  {
    id: 4,
    question: "Для чего в React используется JSX?",
    options: ["Для работы с базами данных", "Для написания стилей", "Для описания структуры пользовательского интерфейса", "Для серверного рендеринга"],
    correctAnswer: "Для описания структуры пользовательского интерфейса",
  },
  {
    id: 5,
    question: "Какой метод массива удаляет последний элемент и возвращает его?",
    options: ["shift()", "push()", "pop()", "slice()"],
    correctAnswer: "pop()",
  },
];